In [1]:
import pandas as pd
# checking version
print(pd.__version__)

1.5.3

In [2]:
# Create a simple Pandas Series from a list:

a = [1, 2, 3, 4]

s = pd.Series(a)
print(s)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
type(s)

pandas.core.series.Series

**With the index argument, you can name your own labels.**

In [4]:
series = pd.Series(a, index = ["x", "y", "z","a"])

print(series)

x    1
y    2
z    3
a    4
dtype: int64

**When you have created labels, you can access an  item by referring to the label.**

In [5]:
# check the value at index "a"

series["y"]

2

**Create a simple Pandas Series from a dictionary of temperature**

In [6]:
temperature = {"day1": 42, "day2": 40, "day3": 39}

series = pd.Series(temperature)

print(series)

day1    42
day2    40
day3    39
dtype: int64

**Create Dataframe from Dictionary**

In [7]:

    '''   "weekday": ["monday", "tuesday", "wednesday", "thursday", "Friday", "saturday", "sunday"],
       "temperature": [42, 48, 39, 42, 38, 36, 44],
       "wind": ["slow", "fast", "slow", "fast", "slow", "fast", "slow"],
       "weather": ["sunny", "cloudy", "cloudy", "sunny", "cold", "cold", "sunny"]'''

'   "weekday": ["monday", "tuesday", "wednesday", "thursday", "Friday", "saturday", "sunday"],\n   "temperature": [42, 48, 39, 42, 38, 36, 44],\n   "wind": ["slow", "fast", "slow", "fast", "slow", "fast", "slow"],\n   "weather": ["sunny", "cloudy", "cloudy", "sunny", "cold", "cold", "sunny"]'

In [8]:
data= {
       "weekday": ["monday", "tuesday", "wednesday", "thursday", "Friday", "saturday", "sunday"],
       "temperature": [42, 48, 39, 42, 38, 36, 44],
       "wind": ["slow", "fast", "slow", "fast", "slow", "fast", "slow"],
       "weather": ["sunny", "cloudy", "cloudy", "sunny", "cold", "cold", "sunny"]
      }
df = pd.DataFrame(data)
# most of the time we use df dataframe variable
print(df)

     weekday  temperature  wind weather
0     monday           42  slow   sunny
1    tuesday           48  fast  cloudy
2  wednesday           39  slow  cloudy
3   thursday           42  fast   sunny
4     Friday           38  slow    cold
5   saturday           36  fast    cold
6     sunday           44  slow   sunny

**Check the shape of our pandas dataframe.**

In [9]:
df.shape

(7, 4)

**Dataframe raw**

In [10]:
df.head()

     weekday  temperature  wind weather
0     monday           42  slow   sunny
1    tuesday           48  fast  cloudy
2  wednesday           39  slow  cloudy
3   thursday           42  fast   sunny
4     Friday           38  slow    cold

In [11]:
df.tail(4)

    weekday  temperature  wind weather
3  thursday           42  fast   sunny
4    Friday           38  slow    cold
5  saturday           36  fast    cold
6    sunday           44  slow   sunny

**Dataframe column**

In [12]:
df.columns

Index(['weekday', 'temperature', 'wind', 'weather'], dtype='object')

In [13]:
#print only temperature data

df[["temperature"]]

   temperature
0           42
1           48
2           39
3           42
4           38
5           36
6           44

In [14]:
#print temperature and weekday columns

df[["temperature", "weekday"]]

   temperature    weekday
0           42     monday
1           48    tuesday
2           39  wednesday
3           42   thursday
4           38     Friday
5           36   saturday
6           44     sunday

In [15]:
# sort the temperature column in descending order:

df.sort_values("temperature", ascending=True)

     weekday  temperature  wind weather
5   saturday           36  fast    cold
4     Friday           38  slow    cold
2  wednesday           39  slow  cloudy
0     monday           42  slow   sunny
3   thursday           42  fast   sunny
6     sunday           44  slow   sunny
1    tuesday           48  fast  cloudy

**Adding a Column to the dataframe**

In [16]:

# create a series:

city = pd.Series(["Chandigarh", "Delhi", "Kanpur", "Chennai", "Manali", "Mumbai", "Ahmedabad"])

print(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
5        Mumbai
6     Ahmedabad
dtype: object

In [17]:
# Add this column series to the dataframe and name it as cities
df["cities"]= city
df.head()

     weekday  temperature  wind weather      cities
0     monday           42  slow   sunny  Chandigarh
1    tuesday           48  fast  cloudy       Delhi
2  wednesday           39  slow  cloudy      Kanpur
3   thursday           42  fast   sunny     Chennai
4     Friday           38  slow    cold      Manali

**Mean, min, max, median**

In [18]:
#print mean, max, min and median

print(df['temperature'].mean())
print(df['temperature'].max())
print(df['temperature'].min())
print(df['temperature'].median())

41.285714285714285
48
36
42.0

**Index Modification**

In [19]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [20]:
#set cities column as index of df and print the df index
df.set_index('cities', inplace=True)
#df.index
print(df.head())

              weekday  temperature  wind weather
cities
Chandigarh     monday           42  slow   sunny
Delhi         tuesday           48  fast  cloudy
Kanpur      wednesday           39  slow  cloudy
Chennai      thursday           42  fast   sunny
Manali         Friday           38  slow    cold

In [21]:
#reset df index

df.reset_index(inplace=True)

df.head()

       cities    weekday  temperature  wind weather
0  Chandigarh     monday           42  slow   sunny
1       Delhi    tuesday           48  fast  cloudy
2      Kanpur  wednesday           39  slow  cloudy
3     Chennai   thursday           42  fast   sunny
4      Manali     Friday           38  slow    cold

In [33]:
df

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41183,73,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41184,46,blue-collar,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41185,56,retired,married,university.degree,no,yes,no,cellular,nov,fri,...,2,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41186,44,technician,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41187,74,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,3,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no

**Drop Column**

In [35]:
# drop the weekday column

#df.drop('weekday', axis=1, inplace=True)
df.drop("day_of_week", axis=1, inplace = True)
df.head()

,age,job,marital,education,default,housing,loan,contact,month,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,149,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,226,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,151,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,307,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [24]:
df = df.drop('wind', axis=1)
df.head()

       cities  temperature weather
0  Chandigarh           42   sunny
1       Delhi           48  cloudy
2      Kanpur           39  cloudy
3     Chennai           42   sunny
4      Manali           38    cold

In [25]:
df = df.drop('weather', axis=1)
df.head()

       cities  temperature
0  Chandigarh           42
1       Delhi           48
2      Kanpur           39
3     Chennai           42
4      Manali           38

In [26]:
df.head()

       cities  temperature
0  Chandigarh           42
1       Delhi           48
2      Kanpur           39
3     Chennai           42
4      Manali           38

**Adding Rows**

In [27]:
# create a new dataframe d2 with same columns as df

d2= pd.DataFrame({
                  'cities': ['Bengalaru', 'kolkata', 'Srinagar', 'Pune'],
                  'temperature': [34, 35, 36, 31]
                  })

d2.head()

      cities  temperature
0  Bengalaru           34
1    kolkata           35
2   Srinagar           36
3       Pune           31

In [28]:
#merge this dataframe to old dataframe df

df = pd.concat([df,d2])

df.tail()

      cities  temperature
6  Ahmedabad           44
0  Bengalaru           34
1    kolkata           35
2   Srinagar           36
3       Pune           31

In [30]:
url ='https://raw.githubusercontent.com/Sketchjar/MachineLearningHD/main/bank_marketing_dataset.csv'
df = pd.read_csv(url)
#df = pd.read_json(url)
#df = pd.read_xlxs(url)
#print(df)
df.tail(10)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome
41178,62,retired,married,university.degree,no,no,no,cellular,nov,thu,...,2,6,3,success,-1.1,94.767,-50.8,1.031,4963.6,yes
41179,64,retired,divorced,professional.course,no,yes,no,cellular,nov,fri,...,3,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41180,36,admin.,married,university.degree,no,no,no,cellular,nov,fri,...,2,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41181,37,admin.,married,university.degree,no,yes,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41182,29,unemployed,single,basic.4y,no,yes,no,cellular,nov,fri,...,1,9,1,success,-1.1,94.767,-50.8,1.028,4963.6,no
41183,73,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41184,46,blue-collar,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41185,56,retired,married,university.degree,no,yes,no,cellular,nov,fri,...,2,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41186,44,technician,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41187,74,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,3,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no

In [31]:
#Specifying a Datetime Range as the Index of a Series


dates1 = pd.date_range('20190525', periods=12)
print(dates1)

series = pd.Series([1,2,3,4,5,6,7,8,9,10,11,12])
series.index = dates1
print(series)

DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28',
               '2019-05-29', '2019-05-30', '2019-05-31', '2019-06-01',
               '2019-06-02', '2019-06-03', '2019-06-04', '2019-06-05'],
              dtype='datetime64[ns]', freq='D')
2019-05-25     1
2019-05-26     2
2019-05-27     3
2019-05-28     4
2019-05-29     5
2019-05-30     6
2019-05-31     7
2019-06-01     8
2019-06-02     9
2019-06-03    10
2019-06-04    11
2019-06-05    12
Freq: D, dtype: int64

In [ ]:
dates2 = pd.date_range('2019-05-01', periods=12, freq='M')
print(dates2)

In [ ]:
dates2 = pd.date_range('05-01-2019', periods=12, freq='MS')
print(dates2)

In [ ]:
#Creating Dataframe

import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10,4),
 columns=list('ABCD'))
print(df)

In [ ]:
#Specifying Index in Dataframe

df = pd.read_csv('data.csv')
days = pd.date_range('20190525', periods=10)
df.index = days
print(df)

In [ ]:
#Generating Descriptive Statistics on the DataFrame

print(df.describe())

In [ ]:
print(df.mean(0)) # 0 means compute the mean for each columns

In [ ]:
print(df.mean(1)) # 1 means compute the mean for each row

In [ ]:
#Slicing Based on Row Number

print(df[2:4])

In [ ]:
#You can also use the iloc indexer for extracting rows based on row number:
print(df.iloc[2:4])

In [ ]:
#Slicing Based on Row and Column Numbers

print(df.iloc[2:4, 1:4])

In [ ]:
#Slicing Based on Labels

print(df['20190601':'20190603'])

In [ ]:
print(df.loc['20190601':'20190603', ['A','C']])

In [ ]:
#If you want to extract a specific row, use the loc indexer as follows:


print(df.loc['20190601'])

In [ ]:
'''if you want to extract specific rows with datetime as the index, you 
cannot simply pass the date value to the loc indexer as follows:'''
print(df.loc[['20190601','20190603']]) # KeyError

In [ ]:
#Selecting a Single Cell in a DataFrame

from datetime import datetime
d = datetime(2019, 6, 3, 0, 0, 0)
print(df.at[d,'B'])

In [ ]:
#Selecting Based on Cell Value

print(df[(df.A > 0) & (df.B>0)])

In [ ]:
#Transforming DataFrames

print(df.transpose())

In [ ]:
print(df.T)

In [ ]:
'''Sorting Data in a DataFrame
There are two ways that you can sort the data in a DataFrame:
1. Sort by labels (axis) using the sort _ index() function
2. Sort by value using the sort _ values() function'''


print(df.sort_index(axis=0, ascending=False)) # axis = 0 means sort by
 # index

In [ ]:
print(df.sort_index(axis=1, ascending=False)) # axis = 1 means sort by
 # column

In [ ]:
print(df.sort_values('A', axis=0))

In [ ]:
'''To sort based on a particular index, set the axis parameter to 1:
print(df.sort_values('20190601', axis=1))'''

print(df.sort_values('20190601', axis=1))